syms t ;
h=0.6;
sjiao=0.0174;
cjiao=0.9998;
v=(2*9.8*h)^0.5/cjiao;
g=9.8;
t=solve(v*cjiao*t-0.5*g*t^2-h,t);
v1=v*sjiao;
l=v1*2*t;
% %-------------------------------------------------------------------------
syms x y;
x=0.0175;
h=0.0551;%3            %绳长的改变
y=solve((0.005/0.08652*(y*h*0.2*cos(x)-16*sin(x+h)))-x,y); %计算出异常力的合力
%规定1，2号为异常力，算出异常力的大小
fh=52.8152;
s144=0.5877;
s24=0.4067;
syms f1 f2
[f1]=solve(51*0.4067/0.5877-f1,f1);
s12=0.2079;
[f2]=solve(52*0.2079/0.5877-f2,f2);
f1=80+f1;
f2=80+f2;
[f1,f2,v,l] 


% vsp=3.43*cjiao;
% ts=0.045/vsp;
% 
% vsz=3.43*sjiao;
% hjiang=vsz*ts+0.5*9.8*ts^2;