%在确定人数，颠球力度，和站位后 检验出模型的合理性：h>40
syms t;
n=8;
f=80;
%f=71;
sj=0.11/1.7;
g=9.8;
t=solve((0.4+0.1)-(0.5*(n*f*sj)/3.6*t^2+0.5*g*t^2),t);%算出相遇时间
a=(n*f*sj)/3.6;
t=0.2167;%得出的>0的结果
t=t+0.05; 
v1=a*t;
v2=g*t;
m1=3.6; m2=0.27;
v4=((m2-m1)*v2+2*m1*v1)/(m1+m2);
v5=[(m1-m2)*v1+2*m2*v2]/(m1+m2);
h1=v4*v4/(2*g);  %颠球的高度
ans1=h1;
h2=v5*v5/(2*g);
%算出在最优情况下，颠球所用的最小的力并进行检验
syms t;
n=8;
sj=0.11/1.7;
g=9.8;
f=70.79;
t=solve((0.4+0.1)-(0.5*(n*f*sj)/3.6*t^2+0.5*g*t^2),t);%算出相遇时间
a=(n*f*sj)/3.6;
t=0.2167;%得出的>0的结果
t=t+0.05; 
v1=a*t;
v2=g*t;
m1=3.6; m2=0.27;
v4=((m2-m1)*v2+2*m1*v1)/(m1+m2);
v5=[(m1-m2)*v1+2*m2*v2]/(m1+m2);
h1=v4*v4/(2*g);  
h2=v5*v5/(2*g);
[ans1,h1,f]
