
%求出转移矩阵第几步的概率，下一步概率之与当前概率有关
% p1=[0.2 0.4 0.4];
% p2=[0.8 0.1 0.1
%     0.5 0.1 0.4
%     0.5 0.3 0.2];
% x=p1*p2^3;



%求转移矩阵极限概率分布
% p=[0.8 0.1 0.1
%     0.5 0.1 0.4
%     0.5 0.3 0.2];
% p=sym(p');
% [x,y]=eig(p);
% for i=1:3 %改变这个
%     x(:,i)=x(:,i)/sum(x(:,i));
% end

%吸收链
% p=[0.3 0.3 0 0.4
%     0.2 0.3 0.2 0.3
%     0 0.3 0.3 0.4
%     0 0 0 1];


%吸收链例子 竞赛答题最终得分为0 1 2 3 4，0和4为最终的吸收状态，1，2，3是非吸收状态
%2是作为初始状态
% syms p q;
% r=[q,0
%     0 0
%     0 p];
% s=[0 p 0
%     q 0 p
%     0 q 0];
% f=(eye(3)-s)^(-1);
% f=simple(f);
% n=f*ones(3,1);
% n=simple(n);
% b=f*r;
% b=simple(b);




% p=[0.2 0.8 0
%     0.8 0 0.2
%     0.1 0.3 0.6];
% p=sym(p');
% [x,y]=eig(p);
% for i=1:3 %改变这个
%     x(:,i)=x(:,i)/sum(x(:,i));
% end