%x=xlsread('xx.xlsx','b2:f16');
x=[13.6	14.01	14.54	15.64	15.69

    11.5	13	15.15	15.3	15.02
13.76	16.36	16.9	16.56	17.3
12.41	12.7	13.96	14.04	13.46
2.48	2.49	2.56	2.64	2.59
85	85	90	100	105
55	65	75	80	80
65	70	75	85	90
12.8	15.3	16.24	16.4	17.05
15.3	18.4	18.75	17.95	19.3
12.71	14.5	14.66	15.88	15.7
14.78	15.54	16.03	16.87	17.82
7.64	7.56	7.76	7.54	7.7
120	125	130	140	140
80	85	90	90	95

];  %读数据

for i=1:15          %数据这个改一下就行
    x(i,:)=x(i ,:)/x(i,1); %标准数据
end


%%%以下都是套路！！！
data=x;
n=size(data,1);%多少行

ck=data(1,:);m1=size(ck,1);  %提出第一行数据，其他数据与该数据进行关联度运算
bj=data(2:n,:);m2=size(bj,1);

for i=1:m1
    for j=1:m2
            t(j,:)=bj(j,:)-ck(i,:);
    end
    jc1=min(min(abs(t')));
    jc2=max(max(abs(t')));
    rho=0.5;%%系数默认0.5
    ksi=(jc1+rho*jc2)./(abs(t)+rho*jc2);
    rt=sum(ksi')/size(ksi,2);
    r(i,:)=rt; %每次计算结果放到r里
end
%r    %为关联度！




